In [11]:
import numpy as np
import pandas as pd

  Read Data JSON to CSV

In [12]:
Data ='{"employee_name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr.Developer"}]}'

In [13]:
pd.read_json(Data)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_6432\131570499.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(Data)

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr.Developer'}"

read_json(Data_name) function used to read json

If you want to read from a url

df= pd.read_csv('URL', header=None)

df.head()

Convert JSON to CSV

df.to_csv('wine.csv')

Convert JSON to different json format

df.to_json(orient = "index")

If you want to convert a Data Frame to json

In [14]:
df1=pd.read_json(Data)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_6432\135418456.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df1=pd.read_json(Data)

In [15]:
df1.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr.Developer"}}}'

It is very much usual that  whenever you are creating a json you should make sure that you create a json with respect to the records

In [17]:
df1.to_json(orient="records")

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr.Developer"}}]'

If we dont use orient="records" then by default it will take the key value pairs of each and every values

Reading HTML content

webscraping technique

In [27]:
url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'

In [24]:
!pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: six>=1.9 in c:\programdata\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\programdata\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
   ---------------------------------------- 0.0/112.2 kB ? eta -:--:--
   --- ------------------------------------ 10.2/112.2 kB ? eta -:--:--
   ------- ------------------------------- 20.5/112.2 kB 330.3 kB/s eta 0:00:01
   ---------- ---------------------------- 30.7/112.2 kB 435.7 kB/s eta 0:00:01
   -------------- ------------------------ 41.0/112.2 kB 326.8 kB/s eta 0:00:01
   --------------------- ----------------- 61.4/112.2 kB 328.2 kB/s eta 0:00:01
   -------------------------------- ------ 92.2/112.2 kB 476.3 kB/s eta 0:00:01
   -------------------------------------- 112.2/112.2 kB 502.1 kB/s eta 0:00:00
Installing collected packages: html5lib
Successfully installed html5lib-1.1

In [25]:
import html5lib

In [28]:
dfs=pd.read_html(url)

In [29]:
dfs[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [30]:
url_mcc='https://en.wikipedia.org/wiki/Mobile_country_code'

In [31]:
dfs=pd.read_html(url_mcc,match='Country',header=0)

In [32]:
dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

function of (match='Country') is that it matches with one of the columns of the tables

Read Excel Files

df_excel=pd.read_excel('Excel_Sample.xlsx')

df.excel.head()

you can give sheet name as well

df_excel=pd.read_excel('Excel_sample.xlsx','sheet_name=0')

Pickling:-

All pandas object are equipped with to_pickle methods which use Python's cPickle module to save data structures to disk using pickle format

df_excel.to_pickle('df_excel')

df=pd.read_pickle('df_excel')

df.head()